[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.js:87:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.inactive?.message} {'boolean required'}
+                    {errors.inactive.message} {'boolean required'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: UCSBOrganiztionForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
