[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:45:23
         },
         {
             Header: 'inactive',
-            accessor: 'inactive',
+            accessor: "",
         }
     ];
killedBy: UserTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
