[Survived] BlockStatement
src/main/utils/ucsbOrganizationUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsborganization",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
