[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbDiningCommonsMenuItem/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbDiningCommonsMenuItem/edit/2"

Number of calls: 0

<html>
  <head />
