[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:55:43
                             type="text"
                             isInvalid={Boolean(errors.name)}
                             {...register("requesterEmail", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /requesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:73:42
                             id="team-id"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("team-id", {
+                            {...register("", {
                                 required: true
                             })}
killedBy: HelpRequest tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:74:43
                             type="text"
                             isInvalid={Boolean(errors.name)}
                             {...register("team-id", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /team-id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:78:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors["team-id"] && "team-id is required."}
+                            {errors["team-id"] || "team-id is required."}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:78:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors["team-id"] && "team-id is required."}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /team-id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:92:42
                             id="teamOrBreakoutRoom"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("teamOrBreakoutRoom", {
+                            {...register("", {
                                 required: true
                             })}
killedBy: HelpRequest tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:93:43
                             type="text"
                             isInvalid={Boolean(errors.name)}
                             {...register("teamOrBreakoutRoom", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /teamOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:97:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamOrBreakoutRoom && "teamOrBreakoutRoom is required."}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /teamOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:97:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamOrBreakoutRoom && "teamOrBreakoutRoom is required."}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /teamOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:114:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'requestTime is required. '}
+                            {errors.requestTime || 'requestTime is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:114:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'requestTime is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /requestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:129:57
                             id="explanation"
                             type="text"
                             isInvalid={Boolean(errors.explanation)}
-                            {...register("explanation", {
-                                required: true
-                            })}
+                            {...register("explanation", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:130:43
                             type="text"
                             isInvalid={Boolean(errors.explanation)}
                             {...register("explanation", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:150:43
                             type="boolean"
                             isInvalid={Boolean(errors.solved)}
                             {...register("solved", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:154:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.solved && "solved is required."}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:154:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.solved && "solved is required."}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
