[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbDiningCommonsMenuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
-    params: {
-     diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-     name: ucsbDiningCommonsMenuItem.name,
-     station: ucsbDiningCommonsMenuItem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
