[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:51:44
                     id="itemId"
                     type="number"
                     isInvalid={Boolean(errors.itemId)}
-                    {...register("itemId", {
-                        required: "Menu Item ID is required."
-                    })}
+                    {...register("itemId", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Menu Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:83:43
                     id="stars"
                     type="number"
                     isInvalid={Boolean(errors.stars)}
-                    {...register("stars", {
-                        required: "Stars are required.",
-                        min : {
-                            value: 1,
-                            message: "Minimum rating of 1 star"
-                        },
-                        max : {
-                            value: 5,
-                            message: "Maximum rating of 5 stars"
-                        }
-                    })}
+                    {...register("stars", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:87:38
                         required: "Stars are required.",
                         min : {
                             value: 1,
-                            message: "Minimum rating of 1 star"
+                            message: ""
                         },
                         max : {
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Minimum rating of 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:89:31
                             value: 1,
                             message: "Minimum rating of 1 star"
                         },
-                        max : {
-                            value: 5,
-                            message: "Maximum rating of 5 stars"
-                        }
+                        max : {}
                     })}
                 />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Maximum rating of 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:110:22
                     {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateReviewed && 'Date is required. '}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:121:34
                     id="comments"
                     type="text"
                     isInvalid={Boolean(errors.comments)}
-                    {...register("comments")}
+                    {...register("")}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
